[[{"title":"Opening Ceremonies","from":"2:30 PM GMT-0500","duration":30,"description":"kick off the con with the anons at marecon HQ! Hear what we have in store for marecon 2025, with some sneak peeks at some panels, our vendors, and more!","ch":["https://cytu.be/r/marecon","https://cytu.be/r/marecon2-comfys-cottage"]},{"title":"how 2 am draw amre","from":"3:00 PM GMT-0500","duration":60,"description":"become the drawfag you were born to be by learning to draw mares! a shitposty-informative panel to get you going on the /bale/ path!\nbring something to draw with/on, and follow along with this short and sweet panel!","ch":["https://cytu.be/r/marecon2-comfys-cottage"]},{"title":"Mare-itory Control VI","from":"4:00 PM GMT-0500","duration":120,"description":"Join a shared drawpile canvas and fight to fill as much of it as possible with (You)r mare! ","ch":["https://cytu.be/r/marecon"]},{"title":"Digital Dreams : AI art for MLP fans!","from":"6:00 PM GMT-0500","duration":60,"description":"Me and a few friends will be hosting a panel about exploring this new digital medium, AI-generated art, and machine learning. Dive into the art of crafting prompts, discover cutting-edge tools like PonyDiffusion V6, ComfyUI, and ReForge, gain insights into how LoRA functions, and witness the creation of never-before-seen MLP artwork live!","ch":["https://cytu.be/r/marecon2-comfys-cottage"]},{"title":"Mare Bars: Results and Improvements","from":"8:00 PM GMT-0500","duration":30,"description":"Mare Bars, the small convention confectionery project that was unveiled at Mare Fair 2, but how did things turn out in practice?  What could be improved? Will it continue for next year? Stop by to know the answers to these questions and more!","ch":["https://cytu.be/r/marecon"]},{"title":"Blondie's Raucous Regaling","from":"11:30 PM GMT-0500","duration":90,"description":"Greens too slow? Comics too quiet? Videos load too slow? Time for some good ol' fashion oratory storatory. Join Blondie for yet another story time where there is no pre-written script, no real plans, and no second chances. Doing it live and doing it raw.","ch":["https://cytu.be/r/marecon2-comfys-cottage"]}],[{"title":"You should draw some mares NOW","from":"10:00 AM GMT-0500","duration":60,"description":"Don't know how to draw? Procrastinating on starting? Well now's your chance! grab whatever you can get your hands on and join us! We'll go over on how to draw a pony from the POV of someone who hasn't drawn anything since elementary school. And, since most people who are only just starting to draw won't have a tablet at hand, we'll be using paper and pencil; we'll all be on equal ground!\nAnons are encouraged to post their drawings on the board as the panels go on!","ch":["https://cytu.be/r/marecon2-comfys-cottage"]},{"title":"Mareschizo Quizshow","from":"11:30 AM GMT-0500","duration":60,"description":"Do you love mares? When watching the show you can't help but notice the background ponies? Are you tired of those normie questions on the usual MLP trivia contests? Then this is just for you!\nI've prepared a random list of background mares and your job is to guess (or preferably know) their names. Everyone in the audience can participate and we will find the Ultimate Mareschizo!","ch":["https://cytu.be/r/marecon"]},{"title":"Traditional art draw panel 2","from":"1:00 PM GMT-0500","duration":120,"description":"Drawing your requests live, just like on last /mlp/con.","ch":["https://cytu.be/r/marecon2-comfys-cottage"]},{"title":"Fallen Oak Livestream","from":"2:00 PM GMT-0500","duration":60,"description":"Join Kim and the horses at Fallen Oak Equine Recue!","ch":["https://cytu.be/r/marecon"]},{"title":"Marebot Dating Simulator","from":"3:00 PM GMT-0500","duration":60,"description":"AI mare dating! Chat gives suggestions and votes on what to do/say next. Panel organiser will act as DM, rolling dice for their success and wrangling the AI. Goal is to try and seal the deal with as many mares as we have time for.","ch":["https://cytu.be/r/marecon"]},{"title":"Find The Fake!","from":"4:30 PM GMT-0500","duration":60,"description":"The game show that blurs the borders of reality, and calls on (You) to redefine them!\n\nIn this quiz show-style game, the audience will be challenged to identify real mare pictures from AI-generated, (or AI-assisted!) fakes. ","ch":["https://cytu.be/r/marecon"]},{"title":"HLVRAIMLP4: MALM","from":"6:30 PM GMT-0500","duration":120,"description":"Linky invites Anon and several wacky angry guests to her new Linky Mansion, but things take a turn for the worse when there is an unexpected MALM.... a Murder At Linky's Mansion","ch":["https://cytu.be/r/marecon"]}],[{"title":"Game Jam showcase! 2025 edition","from":"4:00 PM GMT-0500","duration":90,"description":"Come join us for the fourth /mlp/ game jam, where we will play the various games our fellow anons have made for us! If you want to participate (No experience needed!) or just want to lurk, go search for the thread on the catalog where more information will be posted. The thread will be created on february 1st and the game jam will run from the 14th to the 28th. And, as it's been done previous years, the games will be played lived in the panel. Don't miss out!","ch":["https://cytu.be/r/marecon"]},{"title":"Closing Ceremonies","from":"9:00 PM GMT-0500","duration":120,"description":"it's over","ch":["https://cytu.be/r/marecon","https://cytu.be/r/marecon2-comfys-cottage"]}]]